; domain
(define (domain HARBOR_V02)
  (:requirements :strips :typing)
  (:types block o_block stack crane bottom dock)
  (:predicates (hold ?c - crane ?x - (either block o_block))
  	       (empty_crane ?c - crane)
	       (empty_tape)
	       (block_in_tape ?x - (either block o_block))
	       (available ?x - o_block)
	       (on ?x - (either o_block block) ?y - (either o_block block bottom) )
	       (top ?x - (either block bottom o_block))
	       (at ?x - (either block bottom o_block) ?s - stack)
	       (at_dock ?x - (either block o_block bottom) ?d - dock)
	       (handle ?c - crane ?s - stack)
	       
  )
  (:action pick-from-stack-bb
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
            )
  )

  (:action pick-from-stack-oo
    :parameters (?x - o_block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (not (available ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
            )
  )

  (:action pick-from-stack-ob
    :parameters (?x - o_block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (not (available ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
            )
  )

  (:action pick-from-stack-bo
    :parameters (?x - block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (available ?y)
            )
  )


  (:action put-on-stack-bb
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
    		  )
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
            )
  )

  (:action put-on-stack-oo
    :parameters (?x - o_block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
    		  )
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (available ?x)
            )
  )



  (:action put-on-stack-ob
    :parameters (?x - o_block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
    		  )
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (available ?x)
            )
  )


 (:action put-on-stack-bo
    :parameters (?x - block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
    		  )
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (not (available ?y))
            )
  )


  (:action pick-from-tape
    :parameters (?x - (either block o_block) ?c - crane)
    :precondition (and (block_in_tape ?x)
                       (empty_crane ?c))
		       
    :effect (and (not (block_in_tape ?x)) (not (empty_crane ?c))
                 (empty_tape) (hold ?c ?x))
  )
  (:action put-on-tape
    :parameters (?x - (either block o_block) ?c - crane)
    :precondition (and (empty_tape)
                       (hold ?c ?x))
		       
    :effect (and (block_in_tape ?x) (empty_crane ?c)
                 (not (empty_tape)) (not (hold ?c ?x)))
  )
)

; problem
(define (problem HARBOR_P02_V02)
(:domain HARBOR_V02)
(:objects C1 C2 - crane B1 B2 B5 B6 B8 B9 B10 B11 - block B3 B4 B7 - o_block
          S1 S2 S3 S4 S5 S6 - stack BOT1 BOT2 BOT3 BOT4 BOT5 BOT6 - bottom 
          D1 D2 - dock)
(:init (EMPTY_CRANE C1)
       (EMPTY_CRANE C2)
       (EMPTY_TAPE)
       (AT BOT1 S1)
       (AT BOT2 S2)
       (AT BOT3 S3)
       (AT BOT4 S4)
       (AT BOT5 S5)
       (AT BOT6 S6)
       (AT_DOCK BOT1 D1)
       (AT_DOCK BOT2 D1)
       (AT_DOCK BOT3 D1)
       (AT_DOCK BOT4 D2)
       (AT_DOCK BOT5 D2)
       (AT_DOCK BOT6 D2)
       (HANDLE C1 S1)
       (HANDLE C1 S2)
       (HANDLE C1 S3)
       (HANDLE C2 S4)
       (HANDLE C2 S5)
       (HANDLE C2 S6)
       ;(AVAILABLE_S S1)
       (ON B1 BOT1)
       (AT B1 S1)
       (AT_DOCK B1 D1)
       (ON B2 B3)
       (AT B2 S5)
       (TOP B2)
       (AT_DOCK B2 D2)
       (ON B3 B5)
       (AT B3 S5)
       (AT_DOCK B3 D2)
       (ON B4 BOT4)
       (AT B4 S4)
       (AT_DOCK B4 D2)
       (ON B5 BOT5)
       (AT B5 S5)
       (AT_DOCK B5 D2)
       (ON B6 BOT6)
       (AT B6 S6)
       (TOP B6)
       (AT_DOCK B6 D2)
       (ON B7 B1)
       (AT B7 S1)
       (TOP B7)
       (AT_DOCK B7 D1)
       (AVAILABLE B7)
       (ON B8 B4)
       (AT B8 S4)
       (TOP B8)
       (AT_DOCK B8 D2)
       (ON B9 BOT2)
       (AT B9 S2)
       (AT_DOCK B9 D1)
       (ON B10 B9)
       (AT B10 S2)
       (TOP B10)
       (AT_DOCK B10 D1)
       (ON B11 BOT3)
       (AT B11 S3)
       (TOP B11)
       (AT_DOCK B11 D1)
)

(:goal (and 
    (AVAILABLE B7) (AVAILABLE B3) (AVAILABLE B4) 
    (AT_DOCK B3 D1) (AT_DOCK B4 D1) (AT_DOCK B7 D1)
)))

; plan
1. (pick-from-stack-bo b2 b3 s5 c2 d2)
   deleted: (empty_crane c2) (on b2 b3) (at b2 s5) (top b2) (at_dock b2 d2)
   added: (hold c2 b2) (top b3) (available b3)
   goals met: 3 of 6
2. (put-on-stack-bb b2 b8 s4 c2 d2)
   deleted: (hold c2 b2) (top b8)
   added: (empty_crane c2) (on b2 b8) (at b2 s4) (top b2) (at_dock b2 d2)
   goals met: 3 of 6
3. (pick-from-stack-ob b3 b5 s5 c2 d2)
   deleted: (empty_crane c2) (on b3 b5) (at b3 s5) (top b3) (available b3) (at_dock b3 d2)
   added: (hold c2 b3) (top b5)
   goals met: 2 of 6
4. (put-on-tape b3 c2)
   deleted: (empty_tape) (hold c2 b3)
   added: (block_in_tape b3) (empty_crane c2)
   goals met: 2 of 6
5. (pick-from-tape b3 c1)
   deleted: (block_in_tape b3) (empty_crane c1)
   added: (empty_tape) (hold c1 b3)
   goals met: 2 of 6
6. (pick-from-stack-bb b2 b8 s4 c2 d2)
   deleted: (empty_crane c2) (on b2 b8) (at b2 s4) (top b2) (at_dock b2 d2)
   added: (hold c2 b2) (top b8)
   goals met: 2 of 6
7. (put-on-stack-ob b3 b10 s2 c1 d1)
   deleted: (hold c1 b3) (top b10)
   added: (empty_crane c1) (on b3 b10) (at b3 s2) (top b3) (at_dock b3 d1) (available b3)
   goals met: 4 of 6
8. (put-on-stack-bb b2 b5 s5 c2 d2)
   deleted: (hold c2 b2) (top b5)
   added: (empty_crane c2) (on b2 b5) (at b2 s5) (top b2) (at_dock b2 d2)
   goals met: 4 of 6
9. (pick-from-stack-bo b8 b4 s4 c2 d2)
   deleted: (empty_crane c2) (on b8 b4) (at b8 s4) (top b8) (at_dock b8 d2)
   added: (hold c2 b8) (top b4) (available b4)
   goals met: 5 of 6
10. (put-on-stack-bb b8 b2 s5 c2 d2)
   deleted: (hold c2 b8) (top b2)
   added: (empty_crane c2) (on b8 b2) (at b8 s5) (top b8) (at_dock b8 d2)
   goals met: 5 of 6
11. (pick-from-stack-ob b4 bot4 s4 c2 d2)
   deleted: (empty_crane c2) (on b4 bot4) (at b4 s4) (top b4) (available b4) (at_dock b4 d2)
   added: (hold c2 b4) (top bot4)
   goals met: 4 of 6
12. (put-on-tape b4 c2)
   deleted: (empty_tape) (hold c2 b4)
   added: (block_in_tape b4) (empty_crane c2)
   goals met: 4 of 6
13. (pick-from-tape b4 c1)
   deleted: (block_in_tape b4) (empty_crane c1)
   added: (empty_tape) (hold c1 b4)
   goals met: 4 of 6
14. (put-on-stack-oo b4 b3 s2 c1 d1)
   deleted: (hold c1 b4) (top b3)
   added: (empty_crane c1) (on b4 b3) (at b4 s2) (top b4) (at_dock b4 d1) (available b4)
   goals met: 6 of 6
